In [14]:
import pandas as pd
data={
    "first name":["suvanesh","tony","caption","tony"],
    "last name":["ragukumar","stark","america","stark"]
}
ds=pd.DataFrame(data)
ds

  first name  last name
0   suvanesh  ragukumar
1       tony      stark
2    caption    america
3       tony      stark

In [15]:
email=[]
for i,j in ds.iterrows():
    firstname=j["first name"]
    lastname=j["last name"]
    k=1
    while(k):
        name=firstname[:k]+lastname+"@gmail.com"
        if name not in email:
            email.append(name)
            break
        else:
            k=k+1
print(email)

['sragukumar@gmail.com', 'tstark@gmail.com', 'camerica@gmail.com', 'tostark@gmail.com']

In [16]:
ds["Email"]=email

In [17]:
ds

  first name  last name                 Email
0   suvanesh  ragukumar  sragukumar@gmail.com
1       tony      stark      tstark@gmail.com
2    caption    america    camerica@gmail.com
3       tony      stark     tostark@gmail.com

In [ ]:
schema-create definition and organization of data within a relational database.
database- it's a collection of related information that can be stored in different ways